#### Terraform Init dev ⚙️`success`

#### Terraform Plan dev 📖`success`

<details><summary>Show Plan</summary>

```

terraform
[0m[1mmodule.openweatherforecast_roles.data.aws_caller_identity.current: Reading...[0m[0m
[0m[1mmodule.openweatherforecast_roles.data.aws_region.current: Reading...[0m[0m
[0m[1mmodule.openweatherforecast_roles.data.aws_region.current: Read complete after 0s [id=us-east-1][0m
[0m[1mmodule.openweatherforecast_roles.data.aws_caller_identity.current: Read complete after 1s [id=730335281548][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m

Terraform will perform the following actions:

[1m  # module.openweatherforecast_roles.module.openWeatherforecast_terraform_role.aws_iam_role.test_role[0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role" "test_role" {
      [32m+[0m[0m arn                   = (known after apply)
      [32m+[0m[0m assume_role_policy    = jsonencode(
            {
              [32m+[0m[0m Statement = [
                  [32m+[0m[0m {
                      [32m+[0m[0m Action    = "sts:AssumeRoleWithWebIdentity"
                      [32m+[0m[0m Condition = {
                          [32m+[0m[0m StringEquals = {
                              [32m+[0m[0m "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
                            }
                          [32m+[0m[0m StringLike   = {
                              [32m+[0m[0m "token.actions.githubusercontent.com:sub" = "repo:Punam-Dev/OpenWeatherForecast.Api:*"
                            }
                        }
                      [32m+[0m[0m Effect    = "Allow"
                      [32m+[0m[0m Principal = {
                          [32m+[0m[0m Federated = "arn:aws:iam::730335281548:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              [32m+[0m[0m Version   = "2012-10-17"
            }
        )
      [32m+[0m[0m create_date           = (known after apply)
      [32m+[0m[0m force_detach_policies = false
      [32m+[0m[0m id                    = (known after apply)
      [32m+[0m[0m managed_policy_arns   = (known after apply)
      [32m+[0m[0m max_session_duration  = 3600
      [32m+[0m[0m name                  = "openwatherforecast-terraform"
      [32m+[0m[0m name_prefix           = (known after apply)
      [32m+[0m[0m path                  = "/"
      [32m+[0m[0m tags_all              = {
          [32m+[0m[0m "Environment" = "Dev"
        }
      [32m+[0m[0m unique_id             = (known after apply)

      [32m+[0m[0m inline_policy {
          [32m+[0m[0m name   = "0-policy"
          [32m+[0m[0m policy = jsonencode(
                {
                  [32m+[0m[0m Statement = [
                      [32m+[0m[0m {
                          [32m+[0m[0m Action   = [
                              [32m+[0m[0m "s3:*",
                            ]
                          [32m+[0m[0m Effect   = "Allow"
                          [32m+[0m[0m Resource = "arn:aws:s3:::k8s-iam-role-dev"
                        },
                    ]
                  [32m+[0m[0m Version   = "2012-10-17"
                }
            )
        }
      [32m+[0m[0m inline_policy {
          [32m+[0m[0m name   = "1-policy"
          [32m+[0m[0m policy = jsonencode(
                {
                  [32m+[0m[0m Statement = [
                      [32m+[0m[0m {
                          [32m+[0m[0m Action   = "secretsmanager:*"
                          [32m+[0m[0m Effect   = "Allow"
                          [32m+[0m[0m Resource = "*"
                        },
                    ]
                  [32m+[0m[0m Version   = "2012-10-17"
                }
            )
        }
    }

[1mPlan:[0m 1 to add, 0 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @Punam-Dev, Action: `pull_request`*